config_emacs.org
#+title Emacs from scratch configuration
#+AUTHOR: Jorge Norena
#+DESCRIPTION: Jorge's custom Emacs config.
#+STARTUP: showeverything
#+Options: toc:2
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Table of Contents :toc:
- [[#issues][Issues]]
- [[#startup-performance][Startup performance]]
- [[#basic-configuration][Basic configuration]]
- [[#other-emacs-inbuilt-configs][Other emacs inbuilt configs]]
- [[#package-manager][Package manager]]
  - [[#auto-update][Auto update]]
- [[#ui][UI]]
  - [[#theme][Theme]]
  - [[#modeline][Modeline]]
  - [[#parentheses-color][Parentheses color]]
  - [[#rainbow-mode-to-show-colors][Rainbow mode to show colors]]
  - [[#dynamic-window-management][Dynamic window management]]
- [[#key-bindings][Key bindings]]
  - [[#general-the-evil-leader][General (the Evil Leader)]]
  - [[#evil-mode][Evil mode]]
  - [[#hydra][Hydra]]
  - [[#which-key][Which key]]
- [[#command-completion-and-search][Command completion and search]]
  - [[#ivy][Ivy]]
  - [[#counsel][Counsel]]
  - [[#helpful][Helpful]]
- [[#org-mode][Org mode]]
  - [[#basic-org-mode-config][Basic org mode config]]
  - [[#table-of-contents][Table of contents]]
  - [[#configure-babel-languages][Configure Babel languages]]
  - [[#auto-tangle-when-saving-org-file-not-working][Auto tangle when saving org file (not working)]]
- [[#development][Development]]
  - [[#ide-features-with-lsp-mode][IDE Features with lsp-mode]]
  - [[#python][Python]]
  - [[#company-mode][Company Mode]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
  - [[#git-time-machine][Git time machine]]
- [[#terminals][Terminals]]
  - [[#vterm][vterm]]
  - [[#eshell][Eshell]]
- [[#file-management][File Management]]
  - [[#dired][Dired]]
- [[#runtime-performance][Runtime Performance]]

* Issues

- Complains about a yas variable not existing when starting up.
- Setup Acutex.
- C/C++.
- Julia installation.
- Improve orgmode.
- Fonts are ugly on a graphical interface. Maybe use Monoid, looks quite good with this theme.
- Consider adding more orgmode key bindings.
- Consider making orgmode key bindings active only in orgmode.
- Load jupyter only when appropriate, currently taking too much startup time.
- Connectivity to cluster.
- Careful with hooks and after statements. We may be missing LSP features on orgmode.

* Startup performance

Measure startup time and increase the thresshold for garbage collection.

#+begin_src emacs-lisp

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun gdisplay-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                     (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'gdisplay-startup-time)

#+end_src

* Basic configuration

This section configures basic settings that remove unneeded elements to make Emacs look a lot more minimal and modern.  If you're just getting started in Emacs, the menu bar might be helpful so you can remove the =(menu-bar-mode -1)= line if you'd like to still see that.

We also add a path for custom script files in this config.

#+begin_src emacs-lisp

(setq inhibit-startup-message t)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
(set-fringe-mode 10)
(unless (display-graphic-p)
    (xterm-mouse-mode 1))

;; Display line numbers
(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)

;; Disable line numbers for some modes
(dolist (mode '(term-mode-hook
		shell-mode-hook
		treemacs-mode-hook
		eshell-mode-hook
              eww-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

;;  Font
;; For mobile use 140
(set-face-attribute 'default nil :height 140)

;; Wrap on words
(global-visual-line-mode t)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Add custom scripts to path
(add-to-list 'load-path "~/.config/custom_emacs/scripts/")

;; Temp files generated by emacs go to trash
(setq backup-directory-alist '((".*" . "~/.Trash")))

;; "sane" defaults
(delete-selection-mode 1)    ;; You can select text and delete it by typing.
(electric-indent-mode -1)    ;; Turn off the weird indenting that Emacs does by default.
(electric-pair-mode 1)       ;; Turns on automatic parens pairing
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))

#+end_src

* Other emacs inbuilt configs

=recentf-mode= allows you to quickly look into recently opened files. Consider binding it to some key. There are packages to do this prettier, but this is inbuilt!

Access minibuffer command history with =M-n= and =M-p=. History length impacts emacs startup time.

With =save-place-mode= emacs remembers cursor position in the file.

By default Emacs fills your init file with a bunch of additional settings at the bottom. Those are settings you set from the program itself. We put them in =custom-vars.el=.

With =global-auto-revert-mode=, emacs will watch for changes in the files on disk and prompt the user.


#+begin_src emacs-lisp

  ; track recent filrs
  (recentf-mode 1)
  
  ; command minibuffer history
  (setq history-length 25)
  (savehist-mode 1)

  ; remember cursor position
  (save-place-mode 1)

  ; Move customization vars specified in graphical interface to a separate file
  (setq custom-file (locate-user-emacs-file "custom-vars.el"))
  (load custom-file 'noerror 'nomessage)

  ;; Avoid graphical dialog boxes
  ;(setq use-dialog-box nil)

  ; Watch open buffers for changes on disk
  (global-auto-revert-mode 1)
  ; For dired and othet non-file buffers
  (setq global-auto-revert-non-file-buffers t)

#+end_src

* Package manager

Emacs has a built in package manager but it doesn't make it easy to automatically install packages on a new system the first time you pull down your configuration.  [[https://github.com/jwiegley/use-package][use-package]] is a really helpful package used in this configuration to make it a lot easier to automate the installation and configuration of everything else we use.

For performance consider loading packages only when needed. For example using hooks, =after=, or =defer: s= for =s= seconds, =bind= so it gets loaded after some key press, or =command= to load it when a command is evoked.

#+begin_src emacs-lisp

  ;; --- Package manager ---

  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
   (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
  (setq use-package-verbose t)

#+end_src

** Auto update

The auto-package-update package helps us keep our Emacs packages up to date!  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use =M-x auto-package-update-now= to update right now!

#+begin_src emacs-lisp :tangle no

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

Since it takes a lot of time to startup, I've disabled it.

* UI

** Theme

A nice alternative is to use the [[https://emacsfodder.github.io/emacs-theme-editor/][Theme creator]].

#+begin_src emacs-lisp 

      ;; --- THEME ---
      ;; preview it with M-x counsel-load-theme

      (use-package doom-themes)
      ;;(load-theme 'doom-gruvbox t)

      (use-package modus-themes
      :ensure t
      :config
      ;; Add all your customizations prior to loading the themes
      (setq modus-themes-italic-constructs nil
	    modus-themes-bold-constructs t
           modus-themes-to-toggle '(modus-vivendi-tinted modus-operandi-tinted))

      ;; Load the theme of your choice.
      (load-theme 'modus-vivendi-tinted t))

#+end_src

** Modeline

#+begin_src emacs-lisp

  ;; Better modeline
    ;; doom modeline was too heavy for mobile devices, and had font problems, planning on using this instead
    ;; (use-package powerline
    ;;   :config (powerline-evil-theme)
    ;;   )

    ;; NOTE: The first time you load your configuration on a new machine, you'll
    ;; need to run the following command interactively so that mode line icons
    ;; display correctly:
    ;;
    ;; M-x all-the-icons-install-fonts
    (use-package all-the-icons)

    (use-package doom-modeline
      :init (doom-modeline-mode 1)
      :custom ((doom-modeline-height 15)))

#+end_src

** Parentheses color

#+begin_src emacs-lisp

    ;; rainbow mode for nested parentheses.
    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))
  
#+end_src

** Rainbow mode to show colors

Display the actual color as a background for any hex color value (ex. #ffffff).  The code block below enables rainbow-mode in all programming modes (prog-mode) as well as org-mode, which is why rainbow works in this document.

#+begin_src emacs-lisp

;; Rainbow mode for colors,  e.g. #ffffff will have a white background
(use-package rainbow-mode
  :diminish
  :hook org-mode prog-mode)

#+end_src

** Dynamic window management

I'll play around with some dynamic window management. Some people complain that it messes up minibuffers and side trees, when it shouldn't.

#+begin_src emacs-lisp

  (use-package edwina
    :ensure t
    :config
    (setq display-buffer-base-action '(display-buffer-below-selected))
    ;; (edwina-setup-dwm-keys)
    (edwina-mode 1))

#+end_src

*** Keybindings

By default these keys are prefixed with =C-c C-w=. Customize =edwina-keymap-prefix= to change the prefix.

|-------------------+--------------------------------------|
| Binding           | Action                               |
|-------------------+--------------------------------------|
| =r=, =C-r=        | Arrange windows                      |
| =n=, =C-n=, =SPC= | Move to next window                  |
| =p=, =C-p=        | Move to previous window              |
| =N=, =C-S-n=      | Swap places with the next window     |
| =P=, =C-S-p=      | Swap places with the previous window |
| =%=, ={=, =[=     | Decrease the size of the master area |
| =^=, =}=, =]=     | Increase the size of the master area |
| =d=, =C-d=        | Decrease number of windows in master |
| =i=               | Increase number of windows in master |
| =k=, =C-k=        | Delete window                        |
| =RET=             | Cycle window to/from master area     |
| =c=, =C-c=        | Clone current window                 |
|-------------------+--------------------------------------|

*TIP:* Set up =dwm=-inspired keys with =(edwina-setup-dwm-keys)=

