config_emacs.org
* Key bindings

This configuration uses [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] for a Vi-like modal editing experience.  [[https://github.com/noctuid/general.el][general.el]] is used for easy keybinding configuration that integrates well with which-key.  [[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

** General (the Evil Leader)

#+begin_src emacs-lisp

;; A function used below
(defun reload-init-file ()
  (interactive)
  (load-file user-init-file))

;; A code to move buffers around
(require 'buffer-move)

;; --- KEY BINDINGS INC. EVIL LEADER ---
;; This may hurt performance in mobile. Try using evil-leader instead.

(use-package general
  :config
  (general-create-definer my/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  (my/leader-keys
    "SPC" '(counsel-M-x :which-key "M-x")
    "." '(counsel-find-file :which-key "Find file")
    "TAB TAB" '(comment-line :which-key "Comment line")
    ;; Buffers
    "b" '(:ignore t :which-key "Bookmarks/Buffers")
    "b c" '(clone-indirect-buffer :which-key "Create indirect buffer copy in a split")
    "b C" '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer in new window")
    "b d" '(bookmark-delete :which-key "Delete bookmark")
    "b b" '(counsel-ibuffer :which-key "Change buffer")
    "b i" '(ibuffer :which-key "List buffers")
    "b k" '(kill-this-buffer :which-key "Kill this buffer")
    "b K" '(kill-some-buffers :which-key "Kill multiple buffers")
    "b l" '(list-bookmarks :which-key "List bookmarks")
    "b m" '(bookmark-set :which-key "Set bookmark")
    "b n" '(next-buffer :which-key "Next buffer")
    "b p" '(previous-buffer :which-key "Previous buffer")
    "b r" '(revert-buffer :which-key "Reload buffer")
    "b R" '(rename-buffer :which-key "Rename buffer")
    "b s" '(basic-save-buffer :which-key "Save buffer")
    "b S" '(save-some-buffers :which-key "Save multiple buffers")
    "b w" '(bookmark-save :which-key "Save current bookmarks to bookmark file")
    ;; Eshell/evaluate
    "e" '(:ignore t :which-key "Eshell/Evaluate")    
    "e b" '(eval-buffer :which-key "Evaluate elisp in buffer")
    "e d" '(eval-defun :which-key "Evaluate defun containing or after point")
    "e e" '(eval-expression :which-key "Evaluate and elisp expression")
    "e h" '(counsel-esh-history :which-key "Eshell history")
    "e l" '(eval-last-sexp :which-key "Evaluate elisp expression before point")
    "e r" '(eval-region :which-key "Evaluate elisp in region")
    "e s" '(eshell :which-key "Eshell")
    ;; Org mode
    "m" '(:ignore t :which-key "Org")
    "m a" '(org-agenda :which-key "Org agenda")
    "m e" '(org-export-dispatch :which-key "Org export dispatch")
    "m i" '(org-toggle-item :which-key "Org toggle item")
    "m t" '(org-todo :which-key "Org todo")
    "m B" '(org-babel-tangle :which-key "Org babel tangle")
    "m T" '(org-todo-list :which-key "Org todo list")
    ;; Orgmode tables
    "m b" '(:ignore t :which-key "Tables")
    "m b -" '(org-table-insert-hline :which-key "Insert hline in table")
    ;; Orgmode dates
    "m d" '(:ignore t :which-key "Date/deadline")
    "m d t" '(org-time-stamp :which-key "Org time stamp")
    ;; Projects
    "p" '(projectile-command-map :which-key "Projectile")
    ;; Windows
    "w" '(:ignore t :which-key "Windows")
    "wc" '(evil-window-delete :which-key "Close window")
    "wn" '(evil-window-new :which-key "New window")
    "ws" '(evil-window-split :which-key "Horizontal split")
    "wv" '(evil-window-vsplit :which-key "Vertical split")
    "wh" '(evil-window-left :which-key "Move to window left")
    "wj" '(evil-window-down :which-key "Move to window down")
    "wk" '(evil-window-up :which-key "Move to window up")
    "wl" '(evil-window-right :which-key "Move to window right")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer move left")
    "w J" '(buf-move-down :wk "Buffer move down")
    "w K" '(buf-move-up :wk "Buffer move up")
    "w L" '(buf-move-right :wk "Buffer move right")
    ;; Help!
    "h" '(:ignore t :which-key "Help")
    "h a" '(counsel-apropos :which-key "Apropos")
    "h b" '(describe-bindings :which-key "Describe bindings")
    "h c" '(describe-char :which-key "Describe character under cursor")
    "h d" '(:ignore t :which-key "Emacs documentation")
    "h d a" '(about-emacs :which-key "About Emacs")
    "h d d" '(view-emacs-debugging :which-key "View Emacs debugging")
    "h d f" '(view-emacs-FAQ :which-key "View Emacs FAQ")
    "h d m" '(info-emacs-manual :which-key "The Emacs manual")
    "h d n" '(view-emacs-news :which-key "View Emacs news")
    "h d o" '(describe-distribution :which-key "How to obtain Emacs")
    "h d p" '(view-emacs-problems :which-key "View Emacs problems")
    "h d t" '(view-emacs-todo :which-key "View Emacs todo")
    "h d w" '(describe-no-warranty :which-key "Describe no warranty")
    "h e" '(view-echo-area-messages :which-key "View echo area messages")
    "h f" '(describe-function :which-key "Describe function")
    "h F" '(describe-face :which-key "Describe face")
    "h g" '(describe-gnu-project :which-key "Describe GNU Project")
    "h i" '(info :which-key "Info")
    "h I" '(describe-input-method :which-key "Describe input method")
    "h k" '(describe-key :which-key "Describe key")
    "h l" '(view-lossage :which-key "Display recent keystrokes and the commands run")
    "h L" '(describe-language-environment :which-key "Describe language environment")
    "h m" '(describe-mode :which-key "Describe mode")
    "h r" '(:ignore t :which-key "Reload")
    "h t" '(tldr :which-key "TLDR docs")
    "h v" '(describe-variable :which-key "Describe variable")
    "h w" '(where-is :which-key "Prints keybinding for command if set")
    "h x" '(describe-command :which-key "Display full documentation for command")
    "hrr" '(reload-init-file :which-key "Reload emacs config")
    ;; Toggles
    "t"  '(:ignore t :which-key "Toggles")
    "tt" '(modus-themes-toggle :which-key "Toggle light/dark theme")
    "tl" '(display-line-numbers-mode :which-key "Toggle line numbers")
    "tv" '(vterm-toggle :which-key "Toggle vterm")
    "tr" '(rainbow-mode :which-key "Toggle rainbow mode")
    ;; Find
    "f" '(:ignore t :which-key "Find")
    "ff" '(counsel-find-file :which-key "Find file")
    "fr" '(counsel-recentf :which-key "Recent files")
    ;; Dired
    "d" '(:ignore t :which-key "Dired")
    "d d" '(dired :which-key "Open dired")
    "d j" '(dired-jump :which-key "Dired jump to current")
    "d n" '(neotree-dir :which-key "Open directory in neotree")
    "d p" '(peep-dired :which-key "Peep-dired")
    ;; Git
    "g" '(:ignore t :wk "Git")    
    "g /" '(magit-displatch :wk "Magit dispatch")
    "g ." '(magit-file-displatch :wk "Magit file dispatch")
    "g b" '(magit-branch-checkout :wk "Switch branch")
    "g c" '(:ignore t :wk "Create") 
    "g c b" '(magit-branch-and-checkout :wk "Create branch and checkout")
    "g c c" '(magit-commit-create :wk "Create commit")
    "g c f" '(magit-commit-fixup :wk "Create fixup commit")
    "g C" '(magit-clone :wk "Clone repo")
    "g f" '(:ignore t :wk "Find") 
    "g f c" '(magit-show-commit :wk "Show commit")
    "g f f" '(magit-find-file :wk "Magit find file")
    "g f g" '(magit-find-git-config-file :wk "Find gitconfig file")
    "g F" '(magit-fetch :wk "Git fetch")
    "g g" '(magit-status :wk "Magit status")
    "g i" '(magit-init :wk "Initialize git repo")
    "g l" '(magit-log-buffer-file :wk "Magit buffer log")
    "g r" '(vc-revert :wk "Git revert file")
    "g s" '(magit-stage-file :wk "Git stage file")
    "g t" '(git-timemachine :wk "Git time machine")
    "g u" '(magit-stage-file :wk "Git unstage file")
  ))

#+end_src

** Evil mode

