config_emacs.org
** Basic org mode config

First a few functions to improve the headings and the text. This doesn't seem to work on mobile. But I do plan to keep the replacement of hyphen with dots, the fixed pitch, and the ellipsis replaced with an arrow (if the fonts allow it).

#+begin_src emacs-lisp

  (defun org-font-setup ()
  
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
			    '(("^ *\\([-]\\) "
			       (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    ;; Consider removing all this visual stuff for mobile
    (dolist (face '((org-level-1 . 1.4)
		    (org-level-2 . 1.3)
		    (org-level-3 . 1.2)
		    (org-level-4 . 1.1)
		    (org-level-5 . 1.05)
		    (org-level-6 . 1.05)
		    (org-level-7 . 1.05)
		    (org-level-8 . 1.05)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

#+end_src

Now the org-mode configuration. This has a bunch of configs for the agenda, tags, agenda modes, capture templates,

#+begin_src emacs-lisp


  ;; --- ORG MODE! ---

  (setq evil-want-C-i-jump nil)  

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . org-font-setup)
    :config
    (setq org-ellipsis " ▾")

    ;; Avoid strange indentation behavior orgmode
    (electric-indent-mode -1) ;; if this doesn't work, try doing it after the hook below
    (setq org-edit-src-content-indentation 0) ;; 

    ;; What does this do?
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    ;; Which files to use for the agenda.
    (setq org-agenda-files
          '("~/org/Tasks.org"
            "~/org/Schedule.org"
            "~/org/Dates.org"))

    ;; Custom To do keywords / states
    (setq org-todo-keywords
          '((sequence "TODO(t)" "NEXT(n)" "ACTIVE(a)" "|" "DONE(d!)")))

    ;; Files to use for refiling
    (setq org-refile-targets
      '(("Archive.org" :maxlevel . 1)
        ("Tasks.org" :maxlevel . 1)))
    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    ;; Tags
    (setq org-tag-alist
      '((:startgroup)
         ; Put mutually exclusive tags here
         (:endgroup)
         ("@errand" . ?E)
         ("@home" . ?H)
         ("@work" . ?W)
         ("agenda" . ?a)
         ("planning" . ?p)
         ("publish" . ?P)
         ("batch" . ?b)
         ("note" . ?n)
         ("idea" . ?i)))

    ;; Configure custom agenda views
    (setq org-agenda-custom-commands
     '(("d" "Dashboard"
       ((agenda "" ((org-deadline-warning-days 7)))
        (todo "NEXT"
          ((org-agenda-overriding-header "Next Tasks")))
        (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

      ("n" "Next Tasks"
       ((todo "NEXT"
          ((org-agenda-overriding-header "Next Tasks")))))

      ("W" "Work Tasks" tags-todo "+work-email")

      ;; Low-effort next actions
      ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
       ((org-agenda-overriding-header "Low Effort Tasks")
        (org-agenda-max-todos 20)
        (org-agenda-files org-agenda-files)))))

    (setq org-capture-templates
      `(("t" "Tasks / Projects")
        ("tt" "Task" entry (file+olp "~/org/Tasks.org" "Inbox")
             "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

        ("j" "Journal Entries")
        ("jj" "Journal" entry
             (file+olp+datetree "~/org/Journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
             :clock-in :clock-resume
             :empty-lines 1)
        ("jm" "Meeting" entry
             (file+olp+datetree "~/org/Journal.org")
             "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)))

    ;; Capture keybindings
    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "jj")))

    (org-font-setup))

  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  (defun gorg-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . gorg-mode-visual-fill))

  ;; Function to set up RET key binding in normal mode
  (defun my/org-mode-evil-setup ()
    "Custom configurations for org-mode with evil-mode."
    (evil-define-key 'normal org-mode-map (kbd "RET") 'org-open-at-point)
    (evil-define-key 'normal org-mode-map (kbd "C-i") 'org-cycle))

  ;; Add the function to the org-mode hook
  (add-hook 'org-mode-hook 'my/org-mode-evil-setup)
#+end_src

** Table of contents

#+begin_src emacs-lisp

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

#+end_src

** Configure Babel languages

Org-tempo is not a separate package but a module within org that can be enabled.  Org-tempo allows for '<s' followed by TAB to expand to a begin_src tag.  Other expansions available include:

| Typing the below + TAB | Expands to ...                           |
|------------------------+------------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT   |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'        |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'      |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'      |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'        |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'   |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT'  |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'          |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'              |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'          |
| <sh                    | '#+begin_src shell' ... '#+end_src'      |
| <py                    | '#+begin_src python' ... '#+end_src'     |
| <el                    | '#+begin_src emacs-lisp' ... '#+end_src' |

The last we added below

#+begin_src emacs-lisp

(with-eval-after-load 'org ;defer until org loads
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

  (org-babel-do-load-languages
      'org-babel-load-languages
	'((emacs-lisp . t)
	  (python . t)
      (jupyter . t) ;Currently not working
      ;(ipython . t)
    )) ;See the python section
)
#+end_src

** Auto tangle when saving org file (not working)

#+begin_src emacs-lisp

  (defun org-babel-tangle-config ()
   (when (string-equal (buffer-file-name)
	  (expand-file-name "~/.config/custom_emacs/config_emacs.org"))
  ;; dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
     (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'save-after-hook #'org-babel-tangle-config)))

#+end_src

* Development

** IDE Features with lsp-mode

*** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp

  (defun glsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . glsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

#+end_src

When installing =dap-mode= use =:commands dap-debug=. Also use =after= for =pyenv=.

