config_emacs.org
*** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

*** lsp-treemacs

[[https://github.com/emacs-lsp/lsp-treemacs][lsp-treemacs]] provides nice tree views for different aspects of your code like symbols in a file, references of a symbol, or diagnostic messages (errors and warnings) that are found in your code.

Try these commands with =M-x=:

- =lsp-treemacs-symbols= - Show a tree view of the symbols in the current file
- =lsp-treemacs-references= - Show a tree view for the references of the symbol under the cursor
- =lsp-treemacs-error-list= - Show a tree view for the diagnostic messages in the project

This package is built on the [[https://github.com/Alexander-Miller/treemacs][treemacs]] package which might be of some interest to you if you like to have a file browser at the left side of your screen in your editor.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp-mode)

#+end_src

*** lsp-ivy

[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:

- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces

#+begin_src emacs-lisp

  (use-package lsp-ivy
    :after lsp-mode)

#+end_src

*** Debugging with dap-mode

[[https://emacs-lsp.github.io/dap-mode/][dap-mode]] is an excellent package for bringing rich debugging capabilities to Emacs via the [[https://microsoft.github.io/debug-adapter-protocol/][Debug Adapter Protocol]].  You should check out the [[https://emacs-lsp.github.io/dap-mode/page/configuration/][configuration docs]] to learn how to configure the debugger for your language.  Also make sure to check out the documentation for the debug adapter to see what configuration parameters are available to use for your debug templates!

#+begin_src emacs-lisp

  (use-package dap-mode
    ;; Uncomment the config below if you want all UI panes to be hidden by default!
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)
    :commands 'dap-debug
    :config

    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
      :keymaps 'lsp-mode-map
      :prefix lsp-keymap-prefix
      "d" '(dap-hydra t :which-key "debugger")))

#+end_src

*** Syntax checking with flycheck 

For info on flycheck see [[https://www.flycheck.org/en/latest/languages.html][this]].

#+begin_src emacs-lisp

(use-package flycheck
  :defer t
  :after lsp-mode
  :diminish
  :init (global-flycheck-mode))

#+end_src

*** Code snippets with yasnip 

Snippet autocompletion.

#+begin_src emacs-lisp

(use-package yasnippet
  :after lsp-mode 
  :init (global-yas-mode))

(use-package yasnippet-snippets
  :after yasnippet)

#+end_src

** Python

See the following:

- [[https://www.emacswiki.org/emacs/PythonProgrammingInEmacs][Emacs wiki on python programming]].
- [[https://sqrtminusone.xyz/posts/2021-05-01-org-python/][Replacing Jupyter notebook with org mode]].
- [[https://martibosch.github.io/jupyter-emacs-universe/][Jupyter in the Emacs universe]].

It seems that the closed-source =pyright= is faster. Consider using that if =pyls= is too slow.

We use =lsp-mode= and =dap-mode= to provide a more complete development environment for Python in Emacs.  Check out [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pyls/][the =pyls= configuration]] in the =lsp-mode= documentation for more details.

Make sure you have the =pyls= language server installed before trying =lsp-mode=!

#+begin_src sh :tangle no

pip install --user "python-lsp-server"
pip install --user "debugpy"

#+end_src

There are a number of other language servers for Python so if you find that =pyls= doesn't work for you, consult the =lsp-mode= [[https://emacs-lsp.github.io/lsp-mode/page/languages/][language configuration documentation]] to try the others!

#+begin_src emacs-lisp

  (use-package python-mode
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (setq lsp-pylsp-server-command "pylsp")
    (setq lsp-pylsp-plugins-jedi-completion-enabled t)  ; Enable Jedi completion setup
    (setq lsp-pylsp-plugins-pylint-enabled t)           ; Enable Pylint for linting
    (setq lsp-pylsp-plugins-flake8-enabled t)           ; Optionally, enable Flake8 for linting
    (require 'dap-python)
    (dap-python-setup))


#+end_src

You can use the pyvenv package to use =virtualenv= environments in Emacs.  The =pyvenv-activate= command should configure Emacs to cause =lsp-mode= and =dap-mode= to use the virtual environment when they are loaded, just select the path to your virtual environment before loading your project.

#+begin_src emacs-lisp :tangle no

  (use-package pyvenv
    :after python-mode
    :config
    (pyvenv-mode 1))

#+end_src

We instead use Anaconda, so use the following

#+begin_src emacs-lisp

(use-package conda
  :after python-mode
  :config
  (setq conda-anaconda-home (expand-file-name "~/Programs/miniforge3/"))
  (setq conda-env-home-directory (expand-file-name "~/Programs/miniforge3/"))
  (setq conda-env-subdirectory "envs")

  (unless (getenv "CONDA_DEFAULT_ENV")
    (conda-env-activate "base")))

(use-package company-anaconda
  :after '(company conda)
  :config
    '(add-to-list 'company-backends 'company-anaconda)
)

(add-hook 'python-mode-hook 'anaconda-mode)

#+end_src

When using anaconda, autocompletion won't work on imports. Hopefully the above solves this.

**** Jupyter 

#+begin_src emacs-lisp 

(use-package jupyter)

#+end_src

We import several scripts that allow us to easily interact with the kernel. Look at the description [[file:scripts/jupyter_utils.org][here]].

#+begin_src emacs-lisp

(require 'my-jupyter-utils)

#+end_src

For some reason, ~M-x jupyter-run-repl~ has permision problems and fails to run on mobile.

There's a [[https://github.com/termux/proot/issues/248][hack]] that makes it work (wonder how long it'll last):

#+begin_src C :tangle skip_getifaddrs.c
#include <errno.h>
#include <ifaddrs.h>
int getifaddrs(struct ifaddrs **ifap) {
	errno = EOPNOTSUPP;
	return -1;
}
#+end_src

#+begin_src bash
gcc skip_getifaddrs.c -o skip_getifaddrs.so -shared
#+end_src

To get a kernel to run do the following

#+begin_src bash
LD_PRELOAD=~/.config/custom_emacs/skip_getifaddrs.so jupyter notebook
#+end_src

When attempting =jupyter-run-repl=, I get a =ipresolver.cpp permission denied= error. When attempting =jupyter-connect-repl=, I get an error regarding the ZMQ module. (At least on the tablet.) However, when running org code cells, it seems to execute (but on a local process, not on jupyter). See [[https://github.com/nnicandro/emacs-zmq][the ZMQ github page]].

I attempted installing =autoconf=, =zeromq=, =automake=, and =libtool=. This could compile ZMQ by going to the =src= folder inside the =zmq= directory found in =.config/emacs/elpa=, running ~aclocal~, ~autoreconf -i~, and then ~make~ in the parent directory. Ialso set some variables as suggested in the ZMQ github page. [[https://stackoverflow.com/questions/18978252/error-libtool-library-used-but-libtool-is-undefined][This post]] really helped. Now ZMQ is installed, but trying to use it crashes emacs!

I redownloaded ZMQ by cloning into the github repo. I ran =make= on its directory. Then opened emacs by using

#+begin_src shell

LD_PRELOAD=~/.config/custom_emacs/skip_getifaddrs.so emacs

#+end_src

Now at least I can use =M-x jupyter-run-repl=.

We tried with the older [[https://github.com/gregsexton/ob-ipython][ob-ipython]].

#+begin_src emacs-lisp :tangle no

(use-package ob-ipython)

#+end_src

Tests with this older package give a strange JSON error. 

*** LUA

Emacs doesn't come with LUA highlighting by default. For now, we simply use the following

#+begin_src emacs-lisp

;; LUA support
(use-package lua-mode)

#+end_src

** Company Mode

[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Projectile

[[https://projectile.mx/][Projectile]] is a project management library for Emacs which makes it a lot easier to navigate around code projects for various languages.  Many packages integrate with Projectile so it's a good idea to have it installed even if you don't use its commands directly.

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    ;(when (file-directory-p "~/Projects/Code")
    ;  (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src

** Magit

[[https://magit.vc/][Magit]] is the best Git interface I've ever used.  Common Git operations are easy to execute quickly using Magit's command panel system.

#+begin_src emacs-lisp

    ;; Magit for git interface
    (use-package magit
      :commands magit-status ;add more commands if needed
      :custom
      (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

    ;; NOTE: Make sure to configure a GitHub token before using this package!
    ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
    ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
    (use-package forge
      :after magit)

#+end_src

